Revit 2024 API
AssetPropertyDoubleMatrix44 Class
 Represents a property consisting of an array of double values.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetPropertyDoubleMatrix44 : AssetProperty
Visual Basic
Public Class AssetPropertyDoubleMatrix44 _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyDoubleMatrix44 : public AssetProperty
Remarks
 In virtually all cases, the array will contain exactly 16 values. It represents a 4x4 matrix.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleMatrix44
See Also
AssetPropertyDoubleMatrix44 Members
Autodesk.Revit.DB.Visual Namespace